import pandas as pd
import matplotlib.pyplot as plt

#기준금리와 부동산 매매 가격 : 기준 금리와 아파트 가격의 관계를 분석

realEstate = [83, 83, 83.5, 83.8, 83.9, 83.7, 84.3, 84.6, 85.2, 85.7, 85.7, 85.7, 86.3
               , 86.8, 87.4, 87.4, 87.4, 87.4, 87.6, 88.2, 88.8, 89.4, 89.7, 89.9, 90.5
               , 91.1, 92, 92.7, 93.3, 93.8, 94.7, 95.4, 96, 96.4, 96.4, 95.8, 95.7
               , 95.8, 95.7, 95.7, 95.7, 96, 96.6, 97.2, 98.1, 98.8, 98.9, 98.6, 98.3
               , 98.5, 98.7, 98.6, 98.9, 99.4, 100.1, 100.2, 100.3, 100.3, 100, 99.6
               , 99.8, 100.1, 100.2, 100.2, 99.9, 99.7, 99.6, 100.8, 102.2, 102.4
               , 101.6, 100.8, 100.3, 99.9, 99.2, 99, 98.8, 99.1, 99.6, 99.9, 100.3
               , 100.8, 101.7, 102.7, 103.4, 104.7, 105.5, 105.5, 106.3, 108.3, 110.7
               , 112, 112.9, 114.4, 117, 119.8, 122.9, 125.1, 126.7, 128.3, 130.5
               , 133.4, 136.5, 139.7, 142.3, 143.8, 143, 141.6, 140.7, 140.6, 141.1
               , 141.8, 140.5, 139.8, 136.1, 133.4, 130.6, 126.2, 121.1]
interestRate = [2.75, 2.75, 2.75, 2.75, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5
               , 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.25, 2.25, 2, 2, 2, 2, 2, 1.75, 1.75
               , 1.75, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.25
               , 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25
               , 1.25, 1.25, 1.25, 1.25, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5
               , 1.5, 1.5, 1.5, 1.75, 1.75, 1.75, 1.75, 1.75, 1.75, 1.75, 1.75, 1.5
               , 1.5, 1.5, 1.25, 1.25, 1.25, 1.25, 1.25, 0.75, 0.75, 0.5, 0.5, 0.5
               , 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5
               , 0.75, 0.75, 0.75, 1, 1, 1.25, 1.25, 1.25, 1.5, 1.75, 1.75, 2.25, 2.5, 2.5
               , 3, 3.25]

data = { '부동산': realEstate, '금리': interestRate}
# print(data['금리'][0]) # dic의 key값:금리 0번째 요소 출력 / 틈틈히 코드 까먹지않게 복습

plt.scatter(data['부동산'], data['금리'])
#plt.show()      # 부동산이 120 초과일 때는 선형 상관도가 낮을 것으로 예상


# 피어슨 상관분석
df = pd.DataFrame(data)
coef = df.corr(method='pearson')
print(coef)
#          부동산        금리       두 변수의 상관계수 값은 -0.497로 절댓값이 0.5에 가까운 음의 선형 상관관계
#부동산  1.000000 -0.497677  
#금리  -0.497677  1.000000




# 부동산 상승기 상관 분석
originalData = {'부동산':realEstate, '금리':interestRate}

realEstateIndexList = []
interestList = []
lastIndex = -1 

# 부동산 지수가 143.8이 될 때까지만 리스트에 데이터 추가
for key, value in originalData.items():   # dic의 키-값 쌍을 순회 (key='부동산'일 때 value=realEstate, key='금리'일 때 value=interestRate)
    if key == '부동산':
        for i in range(0,len(value)):
            if value[i] == 143.8:
                break
            else:
                realEstateIndexList.append(value[i])    #반복이 끝나면 그 전까지의 값을 리스트에 추가
                lastIndex = i    # 143.8이 나오기 전 마지막 인덱스를 기억하기 위해 존재
    else:
        for i in range(0, lastIndex +1):    # 위에서 구한 lastIndex까지의 interestRate 값을 interestList에 추가
            interestList.append(value[i])

# print(realEstateIndexList)
# print(interestList)
# print(lastIndex)

data1 = {'지수':realEstateIndexList , '금리':interestList}
df = pd.DataFrame(data1)
coef1 = df.corr(method='pearson')
print(coef1)

#           지수        금리    상관계수가 -0.854으로 '지수'와 '금리' 두 변수는 강한 음의 선형 상관관계
# 지수  1.000000 -0.854603
# 금리 -0.854603  1.000000